ARMmbed/mbed-os/features/netsocket/emac-drivers/TARGET_NXP_EMAC/TARGET_LPCTarget/lpc17_emac.cpp
    /* Setup descriptor and clear statuses */
    lpc_enetdata.prxd[idx].control = EMAC_RCTRL_INT | ((uint32_t) (memory_manager->get_len(p) - 1));
    lpc_enetdata.prxd[idx].packet = (uint32_t) memory_manager->get_ptr(p);
    lpc_enetdata.prxs[idx].statusinfo = 0xFFFFFFFF;
    lpc_enetdata.prxs[idx].statushashcrc = 0xFFFFFFFF;

    /* Save pbuf pointer for push to network layer later */
    lpc_enetdata.rxb[idx] = p;

    /* Wrap at end of descriptor list */
    idx++;
    if (idx >= LPC_NUM_BUFF_RXDESCS) {
        idx = 0;
    }

    /* Queue descriptor(s) */
    lpc_enetdata.rx_free_descs -= 1;
    lpc_enetdata.rx_fill_desc_index = idx;
    LPC_EMAC->RxConsumeIndex = idx;
}

/** \brief  Attempt to allocate and requeue a new memory buffer for RX
 *
 *  \returns         >= 1 if a packet or packets were allocated and requeued, otherwise 0
 */
int32_t LPC17_EMAC::lpc_rx_queue()
{
    //struct lpc_enetdata *lpc_enetif = netif->state;
    emac_mem_buf_t *p;
    int32_t queued = 0;

    /* Attempt to requeue as many packets as possible */
    while (lpc_enetdata.rx_free_descs > 0) {
        /* Allocate a pbuf from the pool. We need to allocate at the
           maximum size as we don't know the size of the yet to be
           received packet. */
        p = memory_manager->alloc_heap(EMAC_ETH_MAX_FLEN, 0);
        if (p == NULL) {
            return queued;
        }

        /* Queue packet */
        lpc_rxqueue_pbuf(p);

        /* Update queued count */
        queued++;
    }

    return queued;
}

/** \brief  Sets up the RX descriptor ring buffers.
 *
 *  This function sets up the descriptor list used for receive packets.
 *
 *  \returns                   Always returns ERR_OK
 */
bool LPC17_EMAC::lpc_rx_setup()
{
    /* Setup pointers to RX structures */
    LPC_EMAC->RxDescriptor = (uint32_t) &lpc_enetdata.prxd[0];
    LPC_EMAC->RxStatus = (uint32_t) &lpc_enetdata.prxs[0];
    LPC_EMAC->RxDescriptorNumber = LPC_NUM_BUFF_RXDESCS - 1;

    lpc_enetdata.rx_free_descs = LPC_NUM_BUFF_RXDESCS;
    lpc_enetdata.rx_fill_desc_index = 0;

    /* Build RX buffer and descriptors */
    lpc_rx_queue();

    return true;
}

/** \brief  Allocates a memory buffer and returns the data from the incoming packet.
 *
 *  \return a buffer filled with the received packet (including MAC header)
 *         NULL on memory error
 */
emac_mem_buf_t *LPC17_EMAC::lpc_low_level_input()
{
    emac_mem_buf_t *p = NULL;
    uint32_t idx, length;
    uint16_t origLength;

#ifdef LOCK_RX_THREAD
    TXLockMutex.lock();
#endif

    /* Monitor RX overrun status. This should never happen unless
       (possibly) the internal bus is behing held up by something.
       Unless your system is running at a very low clock speed or
       there are possibilities that the internal buses may be held
       up for a long time, this can probably safely be removed. */
    if (LPC_EMAC->IntStatus & EMAC_INT_RX_OVERRUN) {

        /* Temporarily disable RX */
        LPC_EMAC->MAC1 &= ~EMAC_MAC1_REC_EN;

        /* Reset the RX side */
        LPC_EMAC->MAC1 |= EMAC_MAC1_RES_RX;
        LPC_EMAC->IntClear = EMAC_INT_RX_OVERRUN;

        /* De-allocate all queued RX pbufs */
        for (idx = 0; idx < LPC_NUM_BUFF_RXDESCS; idx++) {
            if (lpc_enetdata.rxb[idx] != NULL) {
                memory_manager->free(lpc_enetdata.rxb[idx]);
                lpc_enetdata.rxb[idx] = NULL;
            }
        }

        /* Start RX side again */
        lpc_rx_setup();

        /* Re-enable RX */
        LPC_EMAC->MAC1 |= EMAC_MAC1_REC_EN;

#ifdef LOCK_RX_THREAD
        TXLockMutex.unlock();
#endif
        return NULL;
    }

    /* Determine if a frame has been received */
    length = 0;
    idx = LPC_EMAC->RxConsumeIndex;

    if (LPC_EMAC->RxProduceIndex != idx) {
        /* Handle errors */
        if (lpc_enetdata.prxs[idx].statusinfo & (EMAC_RINFO_CRC_ERR |
            EMAC_RINFO_SYM_ERR | EMAC_RINFO_ALIGN_ERR | EMAC_RINFO_LEN_ERR)) {

            /* Re-queue the buffer for receive */
            lpc_enetdata.rx_free_descs++;
            p = lpc_enetdata.rxb[idx];
            lpc_enetdata.rxb[idx] = NULL;
            lpc_rxqueue_pbuf(p);

            p = NULL;
        } else {
            /* A packet is waiting, get length */
            length = (lpc_enetdata.prxs[idx].statusinfo & 0x7FF) + 1;
            length -= 4;

            /* Zero-copy */
            p = lpc_enetdata.rxb[idx];
            origLength = memory_manager->get_len(p);
            memory_manager->set_len(p, length);

            /* Free buffer from descriptor */
            lpc_enetdata.rxb[idx] = NULL;
            lpc_enetdata.rx_free_descs++;

            /* Attempt to queue new buffer(s) */
            if (lpc_rx_queue() == 0) {
                /* Re-queue the buffer for receive */
                memory_manager->set_len(p, origLength);
                lpc_rxqueue_pbuf(p);

#ifdef LOCK_RX_THREAD
                TXLockMutex.unlock();
#endif
                return NULL;
            }
        }
    }

#ifdef LOCK_RX_THREAD
    TXLockMutex.unlock();
#endif

    return p;
}

/** \brief  Attempt to read a packet from the EMAC interface.
 *
 */
void LPC17_EMAC::lpc_enetif_input()
{
    emac_mem_buf_t *p;

    /* move received packet into a new memory buffer */
    p = lpc_low_level_input();
    if (p == NULL) {
        return;
    }

    emac_link_input_cb(p);
}

/** \brief  Determine if the passed address is usable for the ethernet
 *          DMA controller.
 *
 *  \param[in] addr Address of packet to check for DMA safe operation
 *  \return          1 if the packet address is not safe, otherwise 0
 */
int32_t LPC17_EMAC::lpc_packet_addr_notsafe(void *addr)
{
    /* Check for legal address ranges */
#if defined(TARGET_LPC17XX)
    if ((((uint32_t) addr >= 0x2007C000) && ((uint32_t) addr < 0x20083FFF))) {
#endif
        return 0;
    }
    return 1;
}

/** \brief  Sets up the TX descriptor ring buffers.
 *
 *  This function sets up the descriptor list used for transmit packets.
 */
bool LPC17_EMAC::lpc_tx_setup()
{
    int32_t idx;

    /* Build TX descriptors for local buffers */
    for (idx = 0; idx < LPC_NUM_BUFF_TXDESCS; idx++) {
        lpc_enetdata.ptxd[idx].control = 0;
        lpc_enetdata.ptxs[idx].statusinfo = 0xFFFFFFFF;
    }

    /* Setup pointers to TX structures */
    LPC_EMAC->TxDescriptor = (uint32_t) &lpc_enetdata.ptxd[0];
    LPC_EMAC->TxStatus = (uint32_t) &lpc_enetdata.ptxs[0];
    LPC_EMAC->TxDescriptorNumber = LPC_NUM_BUFF_TXDESCS - 1;

    lpc_enetdata.lpc_last_tx_idx = 0;
    lpc_enetdata.lpc_reserved_tx_num = 0;

