ARMmbed/mbed-os/features/netsocket/emac-drivers/TARGET_NXP_EMAC/TARGET_LPCTarget/lpc17_emac.cpp
    return true;
}

/** \brief  Free TX buffers that are complete
 *
 *  \param[in] cidx  EMAC current descriptor comsumer index
 */
void LPC17_EMAC::lpc_tx_reclaim_st(uint32_t cidx)
{
    TXLockMutex.lock();

    // If consume index not last freed index or all descriptors in use
    while (cidx != lpc_enetdata.lpc_last_tx_idx || lpc_enetdata.lpc_reserved_tx_num == LPC_NUM_BUFF_TXDESCS) {
        if (lpc_enetdata.txb[lpc_enetdata.lpc_last_tx_idx] != NULL) {
            memory_manager->free(lpc_enetdata.txb[lpc_enetdata.lpc_last_tx_idx]);
            lpc_enetdata.txb[lpc_enetdata.lpc_last_tx_idx] = NULL;
        }

        xTXDCountSem.release();

        lpc_enetdata.lpc_last_tx_idx++;
        if (lpc_enetdata.lpc_last_tx_idx >= LPC_NUM_BUFF_TXDESCS) {
            lpc_enetdata.lpc_last_tx_idx = 0;
        }
        lpc_enetdata.lpc_reserved_tx_num--;
    }

    TXLockMutex.unlock();
}

/** \brief  User call for freeingTX buffers that are complete
 *
 */
void LPC17_EMAC::lpc_tx_reclaim()
{
    lpc_tx_reclaim_st(LPC_EMAC->TxConsumeIndex);
}

 /** \brief  Polls if an available TX descriptor is ready. Can be used to
 *           determine if the low level transmit function will block.
 *
 *  \return 0 if no descriptors are read, or >0
 */
int32_t LPC17_EMAC::lpc_tx_ready()
{
    int32_t fb;
    uint32_t idx, cidx;

    cidx = LPC_EMAC->TxConsumeIndex;
    idx = LPC_EMAC->TxProduceIndex;

    /* Determine number of free buffers */
    if (idx == cidx) {
        fb = LPC_NUM_BUFF_TXDESCS;
    } else if (cidx > idx) {
        fb = (LPC_NUM_BUFF_TXDESCS - 1) -
            ((idx + LPC_NUM_BUFF_TXDESCS) - cidx);
    } else {
        fb = (LPC_NUM_BUFF_TXDESCS - 1) - (cidx - idx);
    }

    return fb;
}

/** \brief  Low level output of a packet. Never call this from an
 *          interrupt context, as it may block until TX descriptors
 *          become available.
 *
 *  \param[in] p the MAC packet to send (e.g. IP packet including MAC addresses and type)
 *  \return ERR_OK if the packet could be sent or an err_t value if the packet couldn't be sent
 */
bool LPC17_EMAC::link_out(emac_mem_buf_t *p)
{
    emac_mem_buf_t *q;
    uint32_t idx, notdmasafe = 0;
    emac_mem_buf_t *np;
    int32_t dn;

    /* Zero-copy TX buffers may be fragmented across a memory buffer chain. Determine
       the number of descriptors needed for the transfer and make sure packet addresses
       are DMA safe.

       A DMA safe address is once that uses external memory or periphheral RAM.
       IRAM and FLASH are not safe! */
    dn = 0;
    for (q = p; q != NULL; q = memory_manager->get_next(q)) {
        ++dn;
        void *ptr = memory_manager->get_ptr(q);
        notdmasafe += lpc_packet_addr_notsafe(ptr);
    }

#if LPC_TX_PBUF_BOUNCE_EN==1
    /* If the buffer chain is not DMA safe, a new bounce buffer will be
       created that will be used instead. This requires an copy from the
       non-safe DMA region to the new buffer. */
    if (notdmasafe) {
        /* Allocate a buffer in DMA memory.
           MEMORY MANAGER HEAP MUST BE IN DMA SAFE MEMORY. */
        np = memory_manager->alloc_heap(memory_manager->get_total_len(p), 0);
        if (np == NULL) {
            memory_manager->free(p);
            return false;
        }
        memory_manager->copy(np, p);
        /* use the new buffer for descriptor queueing. The original buffer will
           be de-allocated. */
        memory_manager->free(p);
        p = np;
        dn = 1;
    }
#else
    if (notdmasafe) {
        MBED_ASSERT(0);
    }
#endif

    /* Wait until enough descriptors are available for the transfer. */
    /* THIS WILL BLOCK UNTIL THERE ARE ENOUGH DESCRIPTORS AVAILABLE */
    for (int32_t count = 0; count < dn; count++) {
        xTXDCountSem.acquire();
    }

    MBED_ASSERT(dn <= lpc_tx_ready());

    TXLockMutex.lock();

    /* Get free TX buffer index */
    idx = LPC_EMAC->TxProduceIndex;

    /* Setup transfers */
    q = p;
    while (dn > 0) {
        dn--;

        /* Only save pointer to free on last descriptor */
        if (dn == 0) {
            /* Save size of packet and signal it's ready */
            lpc_enetdata.ptxd[idx].control = (memory_manager->get_len(q) - 1) | EMAC_TCTRL_INT |
                EMAC_TCTRL_LAST;
            lpc_enetdata.txb[idx] = p;
        }
        else {
            /* Save size of packet, descriptor is not last */
            lpc_enetdata.ptxd[idx].control = (memory_manager->get_len(q) - 1) | EMAC_TCTRL_INT;
            lpc_enetdata.txb[idx] = NULL;
        }

        lpc_enetdata.ptxd[idx].packet = (uint32_t) memory_manager->get_ptr(q);

        q = memory_manager->get_next(q);

        idx++;
        if (idx >= LPC_NUM_BUFF_TXDESCS) {
            idx = 0;
        }
        lpc_enetdata.lpc_reserved_tx_num++;
    }

    LPC_EMAC->TxProduceIndex = idx;

    TXLockMutex.unlock();

    return true;
}

/** \brief  LPC EMAC interrupt handler.
 *
 *  This function handles the transmit, receive, and error interrupt of
 *  the LPC177x_8x. This is meant to be used when NO_SYS=0.
 */
void LPC17xxEthernetHandler(void)
{
    LPC17_EMAC &emac = LPC17_EMAC::get_instance();

    uint32_t ints;

    /* Interrupts are of 2 groups - transmit or receive. Based on the
       interrupt, kick off the receive or transmit (cleanup) task */

    /* Get pending interrupts */
    ints = LPC_EMAC->IntStatus;

    if (ints & RXINTGROUP) {
        /* RX group interrupt(s): Give signal to wakeup RX receive task.*/
        osThreadFlagsSet(emac.RxThread, RX_SIGNAL);
    }

    if (ints & TXINTGROUP) {
        /* TX group interrupt(s): Give semaphore to wakeup TX cleanup task. */
        emac.TxCleanSem.release();
    }

    /* Clear pending interrupts */
    LPC_EMAC->IntClear = ints;
}

/** \brief  Packet reception task
 *
 * This task is called when a packet is received. It will
 * pass the packet to the IP stacks core.
 *
 *  \param[in] pvParameters Not used yet
 */
void LPC17_EMAC::packet_rx(void* pvParameters)
{
    LPC17_EMAC *lpc17_emac = static_cast<LPC17_EMAC *>(pvParameters);

    while (1) {
        /* Wait for receive task to wakeup */
        osThreadFlagsWait(RX_SIGNAL, 0, osWaitForever);

