ARMmbed/mbed-os/features/netsocket/emac-drivers/TARGET_NXP_EMAC/TARGET_LPCTarget/lpc17_emac.cpp
    return true;
}

uint32_t LPC17_EMAC::get_mtu_size() const
{
    return 1500;
}

uint32_t LPC17_EMAC::get_align_preference() const
{
    return 0;
}

void LPC17_EMAC::get_ifname(char *name, uint8_t size) const
{
    memcpy(name, LPC17_ETH_IF_NAME, (size < sizeof(LPC17_ETH_IF_NAME)) ? size : sizeof(LPC17_ETH_IF_NAME));
}

uint8_t LPC17_EMAC::get_hwaddr_size() const
{
    return LPC17_ETH_HWADDR_SIZE;
}

bool LPC17_EMAC::get_hwaddr(uint8_t *addr) const
{
    return false;
}

void LPC17_EMAC::set_hwaddr(const uint8_t *addr)
{
    memcpy(hwaddr, addr, LPC17_ETH_HWADDR_SIZE);

    /* Save station address */
    LPC_EMAC->SA2 = (uint32_t) hwaddr[0] |
        (((uint32_t) hwaddr[1]) << 8);
    LPC_EMAC->SA1 = (uint32_t) hwaddr[2] |
        (((uint32_t) hwaddr[3]) << 8);
    LPC_EMAC->SA0 = (uint32_t) hwaddr[4] |
        (((uint32_t) hwaddr[5]) << 8);
}

void LPC17_EMAC::set_link_input_cb(emac_link_input_cb_t input_cb)
{
    emac_link_input_cb = input_cb;
}

void LPC17_EMAC::set_link_state_cb(emac_link_state_change_cb_t state_cb)
{
    emac_link_state_cb = state_cb;
}

void LPC17_EMAC::add_multicast_group(const uint8_t *addr)
{
    /* No-op at this stage */
}

void LPC17_EMAC::remove_multicast_group(const uint8_t *address)
{
    /* No-op at this stage */
}

void LPC17_EMAC::set_all_multicast(bool all)
{
    /* No-op at this stage */
}

void LPC17_EMAC::power_down()
{
    /* No-op at this stage */
}

LPC17_EMAC::LPC17_EMAC()
    : RxThread(),
      RxThread_cb(),
      TxCleanSem(),
      hwaddr(),
      TxCleanThread(),
      TxCleanThread_cb(),
      PhyThread(),
      PhyThread_cb(),
      TXLockMutex(),
      xTXDCountSem(LPC_NUM_BUFF_TXDESCS),
      emac_link_input_cb(0),
      emac_link_state_cb(0),
      memory_manager(0)
{
}

void LPC17_EMAC::set_memory_manager(EMACMemoryManager &mem_mngr)
{
    memory_manager = &mem_mngr;
}

LPC17_EMAC &LPC17_EMAC::get_instance() {
    static LPC17_EMAC emac;
    return emac;
}

// Weak so a module can override
MBED_WEAK EMAC &EMAC::get_default_instance() {
    return LPC17_EMAC::get_instance();
}

/* --------------------------------- End Of File ------------------------------ */
